cases/test-setup-of-2D-heat-conduction/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 273;

boundaryField
{
    topInsulatedWall
    {
        type            zeroGradient;
    }
    bottomInsulatedWall
    {
        type            zeroGradient;
    }
    leftFixedWall
    {
        type            fixedValue;
        value           uniform 373;
    }
    rightFixedWall
    {
        type            fixedValue;
        value           uniform 273;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
