cases/test-setup-of-2D-heat-conduction/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    topInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       760;
    }
    bottomInsulatedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       780;
    }
    leftFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       800;
    }
    rightFixedWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       820;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       840;
    }
)

// ************************************************************************* //
